In [1]:
pip install seaborn

Requirement already satisfied: seaborn in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (0.11.2)
Requirement already satisfied: matplotlib>=2.2 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from seaborn) (3.3.4)
Requirement already satisfied: scipy>=1.0 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from seaborn) (1.5.4)
Requirement already satisfied: pandas>=0.23 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from seaborn) (1.1.5)
Requirement already satisfied: numpy>=1.15 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from seaborn) (1.19.5)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from matplotlib>=2.2->seaborn) (3.0.7)
Requirement already satisfied: python-dateutil>=2.1 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from matplotlib>=2.2->seaborn) (8.4.0)
Requirement already satisfied: cycler>=0.10 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: pytz>=2017.2 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in /home/dh2409/Documents/deep_learning/env/lib/python3.6/site-packages (from python-dateutil>=2.1->matplotlib>=2.2->seaborn) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.dates as mdates
import datetime
plt.style.use('ggplot')

In [3]:
df1 = pd.read_json('./data/national_case_by_day', convert_axes=False, orient='index')
df2 = pd.read_json('./data/national_injected_by_time', convert_axes=False, orient='columns')
df3 = pd.read_json('./data/national_recovered_by_day', convert_axes=False, orient='columns')
df4 = pd.read_json('./data/national_death_by_day', convert_axes=False, orient='columns')

In [4]:
df1.head(5)

            total  out_quarantine_area  in_quarantine_area
01/12/2020      5                  NaN                 NaN
02/12/2020      7                  NaN                 NaN
03/12/2020      3                  NaN                 NaN
04/12/2020      0                  NaN                 NaN
05/12/2020      4                  NaN                 NaN

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 522 entries, 01/12/2020 to 06/05/2022
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   total                522 non-null    int64
 1   out_quarantine_area  362 non-null    float64
 2   in_quarantine_area   362 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 16.3+ KB

In [6]:
df1.describe()

               total  out_quarantine_area  in_quarantine_area
count     522.000000           362.000000          362.000000
mean    20414.789272         14444.696133        14663.751381
std     51760.406298         25966.899342        37100.525307
min         0.000000             0.000000           70.000000
25%        14.000000          1431.250000         2305.000000
50%      4895.500000          5882.000000         4826.000000
75%     14504.000000         10613.000000         6844.500000
max    454212.000000        128256.000000       337549.000000

In [7]:
df1.isnull().sum().sum()

320

In [8]:
#filling missing value for df1
df1.loc[df1['out_quarantine_area'].isna(),'out_quarantine_area'] = 0
df1.loc[df1['in_quarantine_area'].isna(), 'in_quarantine_area'] = 0
df1.loc[df1['total'].isna(),'total'] = df1['in_quarantine_area'] + df1['out_quarantine_area']

In [9]:
df2.head()

            onceInjected  twiceInjected
07/03/2021             0              0
08/03/2021           377              0
09/03/2021           522              0
10/03/2021           955              0
11/03/2021          1585              0

In [10]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 416 entries, 07/03/2021 to 06/05/2022
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   onceInjected   416 non-null    int64
 1   twiceInjected  416 non-null    int64
dtypes: int64(2)
memory usage: 9.8+ KB

In [11]:
df2.describe()

       onceInjected  twiceInjected
count  4.160000e+02   4.160000e+02
mean   1.158117e+07   2.830538e+07
std    9.611636e+06   3.087962e+07
min    0.000000e+00   0.000000e+00
25%    2.101934e+06   1.129502e+05
50%    1.155504e+07   9.238756e+06
75%    1.677138e+07   6.755249e+07
max    3.409397e+07   7.355419e+07

In [12]:
df2.isnull().sum().sum()

0

In [13]:
df3.head()

            recovered_by_day
01/01/2021                 0
01/01/2022              2990
01/02/2021                 3
01/02/2022             39608
01/03/2021                16

In [14]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 521 entries, 01/01/2021 to 31/12/2021
Data columns (total 1 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   recovered_by_day  521 non-null    int64
dtypes: int64(1)
memory usage: 8.1+ KB

In [15]:
df3.describe()

       recovered_by_day
count      5.210000e+02
mean       1.779650e+04
std        8.140649e+04
min        0.000000e+00
25%        5.000000e+00
50%        1.340000e+03
75%        1.079900e+04
max        1.679138e+06

In [16]:
df3.isnull().sum().sum()

0

In [17]:
df4.head()

            death_by_day
01/01/2021             0
01/01/2022           216
01/02/2021             0
01/02/2022             0
01/03/2021             0

In [18]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 522 entries, 01/01/2021 to 31/12/2021
Data columns (total 1 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   death_by_day  522 non-null    int64
dtypes: int64(1)
memory usage: 8.2+ KB

In [19]:
df4.isnull().sum().sum()

0

In [20]:
df_full = df1.join(df2).join(df3).join(df4)

In [21]:
df_full.head()

,total,out_quarantine_area,in_quarantine_area,onceInjected,twiceInjected,recovered_by_day,death_by_day
01/12/2020,5,0.0,0.0,NaN,NaN,16.0,0
02/12/2020,7,0.0,0.0,NaN,NaN,6.0,0
03/12/2020,3,0.0,0.0,NaN,NaN,8.0,0
04/12/2020,0,0.0,0.0,NaN,NaN,11.0,0
05/12/2020,4,0.0,0.0,NaN,NaN,0.0,0

In [22]:
df_full.tail()

,total,out_quarantine_area,in_quarantine_area,onceInjected,twiceInjected,recovered_by_day,death_by_day
02/05/2022,3123,2615.0,507.0,11926471.0,73401937.0,1090.0,2
03/05/2022,0,1653.0,1056.0,11935482.0,73416701.0,0.0,0
04/05/2022,2709,2105.0,983.0,11971357.0,73456436.0,1825.0,3
05/05/2022,4305,3616.0,689.0,12037588.0,73508937.0,5084.0,2
06/05/2022,3819,2706.0,1113.0,12086643.0,73554186.0,NaN,6

In [23]:
df_full["Date"] = pd.to_datetime(df_full.index, format = "%d/%m/%Y")

In [24]:
df_full.head()

,total,out_quarantine_area,in_quarantine_area,onceInjected,twiceInjected,recovered_by_day,death_by_day,Date
01/12/2020,5,0.0,0.0,NaN,NaN,16.0,0,2020-12-01
02/12/2020,7,0.0,0.0,NaN,NaN,6.0,0,2020-12-02
03/12/2020,3,0.0,0.0,NaN,NaN,8.0,0,2020-12-03
04/12/2020,0,0.0,0.0,NaN,NaN,11.0,0,2020-12-04
05/12/2020,4,0.0,0.0,NaN,NaN,0.0,0,2020-12-05

In [25]:
df_full.info()

<class 'pandas.core.frame.DataFrame'>
Index: 522 entries, 01/12/2020 to 06/05/2022
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   total                522 non-null    int64
 1   out_quarantine_area  522 non-null    float64
 2   in_quarantine_area   522 non-null    float64
 3   onceInjected         416 non-null    float64
 4   twiceInjected        416 non-null    float64
 5   recovered_by_day     521 non-null    float64
 6   death_by_day         522 non-null    int64
 7   Date                 522 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(5), int64(2)
memory usage: 56.7+ KB

In [26]:
df_full.describe()

,total,out_quarantine_area,in_quarantine_area,onceInjected,twiceInjected,recovered_by_day,death_by_day
count,522.000000,522.000000,522.000000,4.160000e+02,4.160000e+02,5.210000e+02,522.000000
mean,20414.789272,10017.203065,10169.114943,1.158117e+07,2.830538e+07,1.779650e+04,80.687739
std,51760.406298,22619.539677,31615.396915,9.611636e+06,3.087962e+07,8.140649e+04,116.191484
min,0.000000,0.000000,0.000000,0.000000e+00,0.000000e+00,0.000000e+00,-382.000000
25%,14.000000,0.000000,0.000000,2.101934e+06,1.129502e+05,5.000000e+00,0.000000
50%,4895.500000,1624.000000,2575.500000,1.155504e+07,9.238756e+06,1.340000e+03,11.500000
75%,14504.000000,8219.250000,5707.000000,1.677138e+07,6.755249e+07,1.079900e+04,128.250000
max,454212.000000,128256.000000,337549.000000,3.409397e+07,7.355419e+07,1.679138e+06,804.000000

In [27]:
df_full.isnull().sum().sum()

213

In [28]:
#fill nan
df_full.fillna(method="ffill",inplace=True)
df_full.fillna(0,inplace=True)

In [29]:
df_full.head()

,total,out_quarantine_area,in_quarantine_area,onceInjected,twiceInjected,recovered_by_day,death_by_day,Date
01/12/2020,5,0.0,0.0,0.0,0.0,16.0,0,2020-12-01
02/12/2020,7,0.0,0.0,0.0,0.0,6.0,0,2020-12-02
03/12/2020,3,0.0,0.0,0.0,0.0,8.0,0,2020-12-03
04/12/2020,0,0.0,0.0,0.0,0.0,11.0,0,2020-12-04
05/12/2020,4,0.0,0.0,0.0,0.0,0.0,0,2020-12-05

In [1]:
fig_dims = (20, 6)
fig, ax = plt.subplots(figsize=fig_dims)
ax = sns.lineplot(x='Date', y='total', data=df_full, ax = ax, label='total')
ax = sns.lineplot(x='Date', y='out_quarantine_area', data=df_full, ax = ax, label='out_quarantine_area')
ax = sns.lineplot(x='Date', y='in_quarantine_area', data=df_full, ax = ax, label='in_quarantine_area')
ax.set_yscale('log')
ax2 = ax.twinx()
ax2 = sns.lineplot(x='Date', y='onceInjected', data=df_full, ax = ax2, label='onceInjected', color='yellow')
ax2 = sns.lineplot(x='Date', y='twiceInjected', data=df_full, ax = ax2, label='twiceInjected', color='green')
ax2.set_yscale('log')
ax.legend(loc="upper left")
ax2.legend(loc='center left')

NameError: name 'plt' is not defined

In [31]:
#Save new dataset for Viet Nam
df_full.to_csv('./data/nation.csv')

In [32]:
#HANOI
df_HaNoi = pd.read_json('./data/HaNoi', convert_axes=False, orient='columns')

In [33]:
df_HaNoi.head()

           case_by_day  death_by_day  recovered_by_day
18/3/2020            0             0                 0
19/3/2020            0             0                 0
20/3/2020            0             0                 0
21/3/2020            0             0                 0
22/3/2020            0             0                 0

In [34]:
df_HaNoi.info()

<class 'pandas.core.frame.DataFrame'>
Index: 751 entries, 18/3/2020 to 7/5/2022
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   case_by_day       751 non-null    int64
 1   death_by_day      751 non-null    int64
 2   recovered_by_day  751 non-null    int64
dtypes: int64(3)
memory usage: 23.5+ KB

In [35]:
df_HaNoi.describe()

        case_by_day  death_by_day  recovered_by_day
count    751.000000    751.000000        751.000000
mean    1312.902796      1.647137          0.696405
std     4559.941274      5.254775          2.817275
min        0.000000      0.000000          0.000000
25%        0.000000      0.000000          0.000000
50%        1.000000      0.000000          0.000000
75%       99.000000      0.000000          0.000000
max    32650.000000     55.000000         38.000000

In [36]:
df_HaNoi.isna().sum().sum()

0

In [37]:
#HANOI
df_BacGiang = pd.read_json('./data/BacGiang', convert_axes=False, orient='columns')

In [38]:
df_BacGiang.head()

           case_by_day  death_by_day  recovered_by_day
18/3/2020            0             0                 0
19/3/2020            0             0                 0
20/3/2020            0             0                 0
21/3/2020            0             0                 0
22/3/2020            0             0                 0

In [39]:
df_BacGiang.info()

<class 'pandas.core.frame.DataFrame'>
Index: 751 entries, 18/3/2020 to 7/5/2022
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   case_by_day       751 non-null    int64
 1   death_by_day      751 non-null    int64
 2   recovered_by_day  751 non-null    int64
dtypes: int64(3)
memory usage: 23.5+ KB

In [40]:
df_BacGiang.isna().sum().sum()

0

In [41]:
#The same operations on CanTho, DaNang, HaiPhong, NgheAn, TPHCM, VinhPhuc